[
	{
		"subject": "UCS303 (OPERATING SYSTEM)",
		"content": {
      "Course objective": "Role and purpose of the operating system, Functionality of a typical operating system, managing atomic access to OS objects.",
      "Operating System Principles": "Operating System Principles: Structuring methods (monolithic, layered, modular, microkernel models), processes, and resources, Concepts of APIs, Device organization, interrupts: methods and implementations, Concept of user/system state and protection, transition to kernel mode.",
			"Concurrency": "Implementing synchronization primitives, Multiprocessor issues (spin locks, reentrancy).",
			"Scheduling and Dispatch":"Dispatching and context switching, Preemptive and non-preemptive scheduling, Schedulers and policies, Processes and threads.",
			"Memory Management":"Review of physical memory and memory management hardware, Working sets and thrashing, Caching, Paging and virtual memory, Virtual file systems.",
			"File Systems":"Files: data, metadata, operations, organization, buffering, sequential, nonsequential, Directories: contents and structure, Naming, searching, access, backups, Journaling and log-structured file systems.",
			"Deadlock":"Introduction, Analysis of conditions, Prevention & avoidance, Detection & recovery.",
			"Security and Protection":"Overview of system security, Security methods and devices, Protection, access control, and authentication.",
			"Virtual Machines":"Types of virtualization (including Hardware/Software, OS, Server, Service, Network).",
			"Device Management":"Characteristics of serial and parallel devices, Buffering strategies, Direct memory access, Disk structure, Disk scheduling algorithms.",
			"Laboratory work":"To explore different operating systems like Linux, Windows etc. To implement main algorithms related to key concepts in the operating systems.\n1. Detailed architecture of linux commands and flow of command execution.\n2. Detailed commands related to basics of linux, file handling, process management.\n3. Shell program having sequential, decision and loop control constructs.\n4. CPU Scheduling Algorithms\n5. Threaded programming in Linux (Eg. POSIX threads in LINUX)",
			"Course learning outcomes (CLOs):": "On completion of this course, the students will be able to\n1. Explain basic operating system concepts such as overall architecture, interrupts, APIs, user mode and kernel mode.\n2. Distinguish concepts related to concurrency including, synchronization primitives, race conditions, critical sections and multi-threading.\n3. Analyze and apply CPU scheduling algorithms, deadlock detection and prevention algorithms.\n4. Examine and categorise various memory management techniques like caching, paging,segmentation, virtual memory, and thrashing.\n5. Appraise high-level operating systems concepts such as file systems, security, protection, virtualization and device-management, disk-scheduling algorithms and various file systems.",
			"Text Books": "1. Silberschatz, A., Galvin, P.B. and Gagne, G., Operating System Concepts, John Wiley (2013).\n2. Stallings, Willam, Operating Systems Internals and Design Principles, Prentice Hall (2014).",
			"Reference Books": "1. 1. Daniel P. Bovet, Marco Cesati, Understanding the Linux Kernel, 3rd Ed., O'Reilly Media(2005). \n2. 2. Michael Kifer, Scott Smolka, Introduction to Operating System Design and Implementation: The OSP 2 Approach, Springer (2007)."
		}
	},
	{
		"subject": "UCS405 (DISCRETE MATHEMATICAL STRUCTURES)",
		"content": {
			"Course Objective":"Detailed study of various discrete and algebraic structures, basic logic, basics of counting and proof techniques.",
			"Sets, Relations, and Functions":"Sets: Operations on set, Inclusion-exclusion principle,Representation of Discrete Structures, Fuzzy set, Multi-set, bijective function, Inverse and Composition of functions, Floor and Ceiling functions, Growth of functions: Big-O notation, Big-Omega and Big-Theta Notations, Determining complexity of a program, Hashing functions, Recursive function, Functions applications.",
			"Relations":"Reflexivity, symmetry, transitivity, Equivalence and partial-ordered relations, Asymmetric, Irreflexive relation, Inverse and complementary relations, Partition and Covering of a set, N-ary relations and database, Representation relation using matrices and digraph, Closure of relations, Warshall’s algorithm, Lexicographic ordering, Hasse diagram, Lattices, Boolean algebra, Application of transitive closure in medicine and engineering. Application: Embedding a partial order.",
			"Graphs Theory":"Representation, Type of Graphs, Paths and Circuits: Euler Graphs, Hamiltonian Paths & Circuits; Cut-sets, Connectivity and Separability, Planar Graphs, Isomorphism, Graph Coloring, Covering and Partitioning, Max flow: Ford-Fulkerson algorithm, Application of Graph theory in real-life applications.",
			"Basic Logic":"Propositional logic, Logical connectives, Truth tables, Normal forms (conjunctive and disjunctive), Validity of well-formed formula, Propositional inference rules (concepts of modus ponens and modus tollens), Predicate logic, Universal and existential quantification.",
			"Proof Techniques and counting":"Notions of implication, equivalence, converse, inverse, contra positive, negation, and contradiction, The structure of mathematical proofs, Direct proofs, Disproving by counter example, Proof by contradiction, Induction over natural numbers, Structural induction, Weak and strong induction, The pigeonhole principle,Solving homogenous and heterogeneous recurrence relations.",
			"Algebraic Structures":"Group, Semi group, Monoids, Homomorphism, Congruencies, Ring, Field, Homomorphism, Congruencies, Applications of algebra to control structure of a program, The application of Residue Arithmetic to Computers.",
			"Course learning outcome (CLO)":"On completion of this course, the students will be able to\n1. Perform operations on various discrete structures such as set, function and relation.\n2. Apply basic concepts of asymptotic notationin analysis of algorithm.\n3. Illustrate the basic properties and algorithms of graphs and apply them in modeling and solving real-world problems.\n4. Comprehend formal logical arguments and translate statements from a natural language into its symbolic structures in logic.\n5. Identify and prove various properties of rings, fields and group.",
			"Text Books":"1. Rosen, K.H., Discrete Mathematics and its Applications, McGraw Hill (2011).\n2. Tremblay, J.P. and Manohar R., Discrete Mathematical Structures with Applications to ComputerScience, Tata McGraw Hill (2007).",
			"Reference Books":"1. Haggard G., Schlipf J. and Whitesides, Sue, Discrete Mathematics for Computer Science, Cengage Learning, (2008).\n2. Johnsonbaugh R., Discrete Mathematics, Pearson Education, (2007)."
		}
	},
	{
		"subject": "UCS301 (DATA STRUCTURES AND ALGORITHMS)",
		"content": {
			"Course Objectives":"To become familiar with different types of data structures and their applications and learn different types of algorithmic techniques and strategies.",
			"Linear Data Structures":"Arrays, Records, Strings and string processing, References and aliasing, Linked lists, Strategies for choosing the appropriate data structure, Abstract data types and their implementation: Stacks, Queues, Priority queues, Sets, Maps.",
			"Basic Analysis":"Differences among best, expected, and worst case behaviours of an algorithm, Asymptotic analysis of upper and expected complexity bounds, Big O notation: formal definition and use, Little o, big omega and big theta notation , Complexity classes, such as constant, logarithmic, linear, quadratic, and exponential, Time and space trade-offs in algorithms, Recurrence relations , Analysis of iterative and recursive algorithms.",
			"Searching and Sorting":"Linear Search, Binary Search, Bubble Sort, Selection Sort, Insertion Sort, Shell Sort, Quick Sort, Heap Sort, Merge Sort, Counting Sort, Radix Sort.",
			"Algorithmic Strategies with examples and problem solving":"Brute-force algorithms with examples, Greedy algorithms with examples, Divide-and-conquer algorithms with examples, Recursive backtracking, Dynamic Programming with examples, Branch-and-bound with examples, Heuristics, Reduction: transform-and-conquer with examples.",
			"Non-Linear Data Structures And Sorting Algorithms":"Hash tables, including strategies for avoiding and resolving collisions, Binary search trees, Common operations on binary search trees such as select min, max, insert, delete, iterate over tree, Graphs and graph algorithms, Representations of graphs, Depth- and breadth-first traversals , Heaps ,Graphs and graph algorithms , Shortest-path algorithms (Dijkstra and Floyd) , Minimum spanning tree (Prim and Kruskal).",
			"Problem Clauses":"P, NP, NP- Hard and NP-complete, deterministic and non-deterministic polynomial time algorithm approximation and algorithm for some NP complete problems. Introduction to parallel algorithms, Genetic algorithms, intelligent algorithms.",
			"Laboratory work":"Implementation of Arrays, Recursion, Stacks, Queues, Lists, Binary trees, Sorting techniques, Searching techniques. Implementation of all the algorithmic techniques.",
			"Course learning outcomes (CLOs)":"On completion of this course, the students will be able to\n1. implement the basic data structures and solve problems using fundamental algorithms.\n2. implement various search and sorting techniques.\n3. analyse the complexity of algorithms, to provide justification for that selection, and to implement the algorithm in a particular context.\n4. analyze, evaluate and choose appropriate data structure and algorithmic technique to solve real-world problems.",
			"Text Books":"\n1. Corman, Leiserson&Rivest, Introduction to Algorithms, MIT Press (2009).\n2. Narasimha Karumanchi, Data Structures and Algorithms Made Easy (2014).",
			"Reference Books":"\n1. Sahni, Sartaj, Data Structures, Algorithms and Applications in C++, Universities Press (2005)"
		}
	},
	{
		"subject": "UMA011 (NUMERICAL ANALYSIS)",
		"content": {
			"Floating-Point Numbers":"Floating-point representation, rounding, chopping, error analysis,  conditioning and stability.",
			"Non-Linear Equations":"Bisection, secant, fixed-point iteration, Newton method for simple and  multiple roots, their convergence analysis and order of convergence.",
			"Linear Systems and Eigen-Values":"Gauss elimination method using pivoting strategies, LU  decomposition, Gauss-Seidel and successive-over-relaxation (SOR) iteration methods and their  convergence, ill and well conditioned systems, Rayleigh's power method for Eigen-values and  Eigen-vectors. ",
			"Interpolation and Approximations":"Finite differences, Newton’s forward and backward  interpolation, Lagrange and Newton's divided difference interpolation formulas with error  analysis, least square approximations.",
			"Numerical Integration":"Newton-Cotes quadrature formulae (Trapezoidal and Simpson's rules)  and their error analysis, Gauss-Legendre quadrature formulae.",
			"Differential Equations":"Solution of initial value problems using Picard, Taylor series, Euler's and  Runge-Kutta methods (up to fourth-order), system of first-order differential equations.",
			"Laboratory Work":"Lab experiments will be set in consonance with materials covered in the  theory. Implementation of numerical techniques using MATLAB.",
			"Course learning outcomes (CLOs)": "After the completion of the course, the student will be able to: \n1. Understand the errors, source of error and its effect on any numerical computations and also analysis the efficiency of any numerical algorithms. \n2. Learn how to obtain numerical solution of nonlinear equations using bisection, secant, newton, and fixed-point iteration methods. \n3. Solve system of linear equations numerically using direct and iterative methods. \n4. Understand how to approximate the functions using interpolating polynomials. \n5. Learn how to solve definite integrals and initial value problems numerically.",
			"Text Books": "\n1. Gerald F. C. and Wheatley O. P., Applied Numerical Analysis, Pearson, (2003) 7thEdition, \n2. Jain K. M., Iyengar K. R. S. and Jain K. R., Numerical Methods for Scientific and Engineering Computation, New Age International Publishers (2012), 6thedition. \n3. Steven C. Chappra, Numerical Methods for Engineers, McGraw-Hill Higher Education; 7 thedition (1 March 2014) \n4. Mathew H. J., Numerical Methods for Mathematics, Science and Engineering, Prentice Hall, (1992) 2ndedition, \n5. Burden L. R. and Faires D. J. Numerical Analysis, Brooks Cole (2011), 9thedition. \n6. Atkinson K. and Han H., Elementary Numerical Analysis, John Willey & Sons (2004), 3 rdEdition"
		}
	},
	{
		"subject": "UCS311 (PRACTICAL COMPUTING)",
		"content": {
			"Could not find": "not found anywhere"
		}
	},
	{
		"subject": "UES012 (ENGINEERING MATERIALS)",
		"content": {
			"Course Objectives":"The objective of the course is to provide basic understanding of engineering  materials, their structure and the influence of structure on mechanical, chemical, electrical and  magnetic properties.",
			"Structure of solids":"Classification of engineering materials, Structure-property relationship in  engineering materials, Crystalline and non-crystalline materials, Miller Indices, Crystal planes and  directions, Determination of crystal structure using X-rays, Inorganic solids, Silicate structures and  their applications. Defects; Point, line and surface defects",
			"Mechanical properties of materials":"Elastic, Inelastic and Viscoelastic behaviour, Engineering  stress and engineering strain relationship, True stress - true strain relationship, review of  mechanical properties, Plastic deformation by twinning and slip, Movement of dislocations,  Critical shear stress, Strengthening mechanism and Creep.",
			"Equilibrium diagram":"Solids solutions and alloys, Gibbs phase rule, Unary and binary  eutecticphase diagram, Examples and applications of phase diagrams like Iron - Iron carbide phase  diagram.",
			"Electrical and magnetic materials":"Conducting and resistor materials, and their engineering  application; Semiconducting materials, their properties and applications; Magnetic materials, Soft  and hard magnetic materials and applications; Superconductors; Dielectric materials, their  properties and applications. Smart materials: Sensors and actuators, piezoelectric, magnetostrictive and electrostrictive materials.",
			"Corrosion process":"Corrosion, Cause of corrosion, Types of corrosion, Protection against  corrosion.",
			"Materials selection":"Overview of properties of engineering materials, Selection of materials for  different engineering applications.",
			"Laboratory Work and Micro-Project": "Note: The micro-project will be assigned to the group(s) of students at the beginning of the semester. Based on the topic of the project the student will perform any of the six experiments from the following list: \n1. To determine Curie temperature of a ferrite sample and to study temperature dependence of permeability in the vicinity of Curie temperature. \n2. To study cooling curve of a binary alloy. \n3. Determination of the elastic modulus and ultimate strength of a given fiber strand. \n3. To determine the dielectric constant of a PCB laminate. \n5. Detection of flaws using ultrasonic flaw detector (UFD). \n6. To determine fiber and void fraction of a glass fiber reinforced composite specimen. \n7. To investigate creep of a given wire at room temperature. \n8. To estimate the Hall coefficient, carrier concentration and mobility in a semiconductor crystal. \n9. To estimate the band-gap energy of a semiconductor using four probe technique. \n10. To measure grain size and study the effect of grain size on hardness of the given metallic specimens.",
			"Course learning outcomes (CLOs)": "After the completion of the course, the student will be able to: \n1. Classify engineering materials based on its structure. \n2. Draw crystallographic planes and directions. \n3. Distinguish between elastic and plastic behavior of materials. \n4. Distinguish between isomorphous and eutectic phase diagram. \n5. Classify materials based on their electrical and magnetic properties. \n6. Propose a solution to prevent corrosion.",
			"Text Books": "\n1. Callister D. W and Rethwisch G. D., Materials Science and Engineering; John Wiley & Sons, Singapore (2013) 9th Edition. \n2. Smith F. W., Principles of Materials Science and Engineering: An Introduction; Tata McGraw Hill, (2008) 3rd Edition. \n3. Raghavan V., Introduction to Materials Science and Engineering, Prentice Hall (2015) 6th Edition.",
			"Reference Books": "\n1. Kasap S., Principles of Electronic Engineering Materials Tata Mc-Graw Hill, 2007. \n2. Vlack V. H. L., Elements of Material Science and Engineering, Pearson, India, (1989) 6th Edition. \n3. Budinski G. K. and Budinski K. M., Engineering Materials – Properties and selection, Prentince Hall India (2002) 7 th Edition."
		}
	},
	{
		"subject": "UCS016 (ENGINEERING DESIGN PROJECT-I)",
		"content": {
			"Course Objectives": "To develop design skills according to a Conceive-Design-Implement Operate (CDIO) compliant methodology. To apply engineering sciences through learning-by doing project work. To provide a framework to encourage creativity and innovation. To \ndevelop team work and communication skills through group-based activity. To foster self directed learning and critical evaluation.\nTo provide a basis for the technical aspects of the project a small number of lectures are \nincorporated into the module. As the students would have received little in the way of formal \nengineering instruction at this early stage in the degree course, the level of the lectures is to be \nintroductory with an emphasis on the physical aspects of the subject matter as applied to the \n‘Mangonel’ project. The lecture series include subject areas such as Materials, Structures, \nDynamics and Digital Electronics delivered by experts in the field.\nThis module is delivered using a combination of introductory lectures and participation by the \nstudents in 15 “activities”. The activities are executed to support the syllabus of the course and \nmight take place in specialised laboratories or on the open ground used for firing the Mangonel. \nStudents work in groups throughout the semester to encourage teamwork, cooperation and to \navail of the different skills of its members. In the end the students work in sub-groups to do the \nMangonel throwing arm redesign project. They assemble and operate a Mangonel, based on \nthe lectures and tutorials assignments of mechanical engineering they experiment with the \nworking, critically analyse the effect of design changes and implement the final project in a \ncompetition. Presentation of the group assembly, redesign and individual reflection of the \nproject is assessed in the end.",
			"Text Books": "1. Michael McRoberts, Beginning Arduino, Technology in action publications. \n2. Alan G. Smith, Introduction to Arduino: A piece of cake, CreateSpace Independent Publishing Platform (2011)",
			"Reference Book": "1. John Boxall, Arduino Workshop - A Hands-On Introduction with 65 Projects, No Starch Press (2013)"
		}
	},
	{
		"subject": "Author's Note",
		"content": {
			"Kudos to you": "Hey, thanks for coming to this one! You made it to the last section and is now greeted with some of my wise words, coughh.. nothing :D",
			"How it works?": "Basically the node script builder/encoder.js builds a readme supported file using unit.json as a base! and converts it into collaspe-able listview! I just copy this to readme.md in the root directory and voila! You got it :D",
			"Why go through all that troubles?": "Dunno, tbh, I myself am thinking the same right now :((",
			"Add more subjects": "See <a href='https://hari01584.github.io/studymap/builder/howtocontribute'>this guide</a> to know about contributing process."
		}
	}
]
