[
	{
		"subject": "UCS303 (OPERATING SYSTEM)",
		"content": {
      "Course objective": "Role and purpose of the operating system, Functionality of a typical operating system, managing atomic access to OS objects.",
      "Operating System Principles": "Operating System Principles: Structuring methods (monolithic, layered, modular, microkernel models), processes, and resources, Concepts of APIs, Device organization, interrupts: methods and implementations, Concept of user/system state and protection, transition to kernel mode.",
			"Concurrency": "Implementing synchronization primitives, Multiprocessor issues (spin locks, reentrancy).",
			"Scheduling and Dispatch":"Dispatching and context switching, Preemptive and non-preemptive scheduling, Schedulers and policies, Processes and threads.",
			"Memory Management":"Review of physical memory and memory management hardware, Working sets and thrashing, Caching, Paging and virtual memory, Virtual file systems.",
			"File Systems":"Files: data, metadata, operations, organization, buffering, sequential, nonsequential, Directories: contents and structure, Naming, searching, access, backups, Journaling and log-structured file systems.",
			"Deadlock":"Introduction, Analysis of conditions, Prevention & avoidance, Detection & recovery.",
			"Security and Protection":"Overview of system security, Security methods and devices, Protection, access control, and authentication.",
			"Virtual Machines":"Types of virtualization (including Hardware/Software, OS, Server, Service, Network).",
			"Device Management":"Characteristics of serial and parallel devices, Buffering strategies, Direct memory access, Disk structure, Disk scheduling algorithms.",
			"Laboratory work":"To explore different operating systems like Linux, Windows etc. To implement main algorithms related to key concepts in the operating systems.\n1. Detailed architecture of linux commands and flow of command execution.\n2. Detailed commands related to basics of linux, file handling, process management.\n3. Shell program having sequential, decision and loop control constructs.\n4. CPU Scheduling Algorithms\n5. Threaded programming in Linux (Eg. POSIX threads in LINUX)",
			"Course learning outcomes (CLOs):": "On completion of this course, the students will be able to\n1. Explain basic operating system concepts such as overall architecture, interrupts, APIs, user mode and kernel mode.\n2. Distinguish concepts related to concurrency including, synchronization primitives, race conditions, critical sections and multi-threading.\n3. Analyze and apply CPU scheduling algorithms, deadlock detection and prevention algorithms.\n4. Examine and categorise various memory management techniques like caching, paging,segmentation, virtual memory, and thrashing.\n5. Appraise high-level operating systems concepts such as file systems, security, protection, virtualization and device-management, disk-scheduling algorithms and various file systems.",
			"Text Books": "1. Silberschatz, A., Galvin, P.B. and Gagne, G., Operating System Concepts, John Wiley (2013).\n2. Stallings, Willam, Operating Systems Internals and Design Principles, Prentice Hall (2014).",
			"Reference Books": "1. 1. Daniel P. Bovet, Marco Cesati, Understanding the Linux Kernel, 3rd Ed., O'Reilly Media(2005). \n2. 2. Michael Kifer, Scott Smolka, Introduction to Operating System Design and Implementation: The OSP 2 Approach, Springer (2007)."
		}
	},
	{
		"subject": "UCS405 (DISCRETE MATHEMATICAL STRUCTURES)",
		"content": {
			"Course Objective":"Detailed study of various discrete and algebraic structures, basic logic, basics of counting and proof techniques.",
			"Sets, Relations, and Functions":"Sets: Operations on set, Inclusion-exclusion principle,Representation of Discrete Structures, Fuzzy set, Multi-set, bijective function, Inverse and Composition of functions, Floor and Ceiling functions, Growth of functions: Big-O notation, Big-Omega and Big-Theta Notations, Determining complexity of a program, Hashing functions, Recursive function, Functions applications.",
			"Relations":"Reflexivity, symmetry, transitivity, Equivalence and partial-ordered relations, Asymmetric, Irreflexive relation, Inverse and complementary relations, Partition and Covering of a set, N-ary relations and database, Representation relation using matrices and digraph, Closure of relations, Warshall’s algorithm, Lexicographic ordering, Hasse diagram, Lattices, Boolean algebra, Application of transitive closure in medicine and engineering. Application: Embedding a partial order.",
			"Graphs Theory":"Representation, Type of Graphs, Paths and Circuits: Euler Graphs, Hamiltonian Paths & Circuits; Cut-sets, Connectivity and Separability, Planar Graphs, Isomorphism, Graph Coloring, Covering and Partitioning, Max flow: Ford-Fulkerson algorithm, Application of Graph theory in real-life applications.",
			"Basic Logic":"Propositional logic, Logical connectives, Truth tables, Normal forms (conjunctive and disjunctive), Validity of well-formed formula, Propositional inference rules (concepts of modus ponens and modus tollens), Predicate logic, Universal and existential quantification.",
			"Proof Techniques and counting":"Notions of implication, equivalence, converse, inverse, contra positive, negation, and contradiction, The structure of mathematical proofs, Direct proofs, Disproving by counter example, Proof by contradiction, Induction over natural numbers, Structural induction, Weak and strong induction, The pigeonhole principle,Solving homogenous and heterogeneous recurrence relations.",
			"Algebraic Structures":"Group, Semi group, Monoids, Homomorphism, Congruencies, Ring, Field, Homomorphism, Congruencies, Applications of algebra to control structure of a program, The application of Residue Arithmetic to Computers.",
			"Course learning outcome (CLO)":"On completion of this course, the students will be able to\n1. Perform operations on various discrete structures such as set, function and relation.\n2. Apply basic concepts of asymptotic notationin analysis of algorithm.\n3. Illustrate the basic properties and algorithms of graphs and apply them in modeling and solving real-world problems.\n4. Comprehend formal logical arguments and translate statements from a natural language into its symbolic structures in logic.\n5. Identify and prove various properties of rings, fields and group.",
			"Text Books":"1. Rosen, K.H., Discrete Mathematics and its Applications, McGraw Hill (2011).\n2. Tremblay, J.P. and Manohar R., Discrete Mathematical Structures with Applications to ComputerScience, Tata McGraw Hill (2007).",
			"Reference Books":"1. Haggard G., Schlipf J. and Whitesides, Sue, Discrete Mathematics for Computer Science, Cengage Learning, (2008).\n2. Johnsonbaugh R., Discrete Mathematics, Pearson Education, (2007)."
		}
	},
	{
		"subject": "UCSXXX (XXX)",
		"content": {

		}
	},
	{
		"subject": "UCSXXX (XXX)",
		"content": {

		}
	},
	{
		"subject": "UCSXXX (XXX)",
		"content": {

		}
	}
]
